# Задача №17. Решение в группах
# Дан список чисел. Определите, сколько в нем
# встречается различных чисел.
# Input: [1, 1, 2, 0, -1, 3, 4, 4]
# Output: 6

list =  [1, 1, 2, 0, -1, 3, 4, 4, 7,7]
list1 = set(list)
print(len(list1))

list2 = []
